src/DataProcessors/МониторКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Соискатели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявители</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиенты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОжидании</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/МониторКонтрагентов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)    
    ЗаполнитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаявкиИзПочты(Команда)
	ОткрытьФорму("Обработка.ЗаказПоПочте.Форма.Форма");
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЗаполнитьДанныеНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаСервере()  
	
	// Получаем ссылки на группы-родители
	ГруппаСоискатели = Справочники.Контрагенты.НайтиПоНаименованию("Соискатели");
	ГруппаЗаявители  = Справочники.Контрагенты.НайтиПоНаименованию("Заявители");
	ГруппаКлиенты    = Справочники.Контрагенты.НайтиПоНаименованию("Клиенты");
	ГруппаВОжидании  = Справочники.Контрагенты.НайтиПоНаименованию("Лист ожидания");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|   ""Соискатели"" КАК ИмяГруппы,
	|   КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|   Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|   Контрагенты.Родитель = &Соискатели
	|   И Контрагенты.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ""Заявители"", 
	|   КОЛИЧЕСТВО(*)
	|ИЗ
	|   Справочник.Контрагенты
	|ГДЕ
	|   Родитель = &Заявители
	|   И ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ""Клиенты"",
	|   КОЛИЧЕСТВО(*)   
	|ИЗ
	|   Справочник.Контрагенты
	|ГДЕ
	|   Родитель = &Клиенты
	|   И ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ""ВОжидании"",
	|   КОЛИЧЕСТВО(*)
	|ИЗ
	|   Справочник.Контрагенты
	|ГДЕ
	|   Родитель = &ВОжидании
	|   И ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Соискатели", ГруппаСоискатели);
	Запрос.УстановитьПараметр("Заявители",  ГруппаЗаявители);
	Запрос.УстановитьПараметр("Клиенты",    ГруппаКлиенты);
	Запрос.УстановитьПараметр("ВОжидании",  ГруппаВОжидании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоСоискателей = 0;
	КоличествоЗаявителей  = 0;
	КоличествоКлиентов    = 0;
	КоличествоВОжидании   = 0;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИмяГруппы = "Соискатели" Тогда
			КоличествоСоискателей = Выборка.Количество;
		ИначеЕсли Выборка.ИмяГруппы = "Заявители" Тогда
			КоличествоЗаявителей = Выборка.Количество;
		ИначеЕсли Выборка.ИмяГруппы = "Клиенты" Тогда
			КоличествоКлиентов = Выборка.Количество;
		ИначеЕсли Выборка.ИмяГруппы = "ВОжидании" Тогда
			КоличествоВОжидании = Выборка.Количество;
		КонецЕсли;
	КонецЦикла; 
	
	Объект.Соискатели = КоличествоСоискателей; 
	Объект.Заявители = КоличествоЗаявителей;
	Объект.Клиенты = КоличествоКлиентов;
	Объект.ВОжидании = КоличествоВОжидании;
		
КонецПроцедуры
